//: [Previous](@previous)

/*:
 # きょうの作業ログ　2020/09/09
 ・9月9日も楽しんでいきましょ〜。
 ・昨晩寝る前にHIGのCatalystのガイドラインを読んでいたら非常に良かった。実質的に「iOSしかやったことがない人むけに、MacOSとの違いを教えてくれるガイドライン」となっていて、学習になった。今日も引き続き進めていく。
 ・Outlineは、Native木でしか表現できないと思ってある程度で諦めた。「今は」諦めた。AppleのAPIでも挿入、削除、追加には線型時間から準線型時間の間ぐらいの速度しか出せていなかったので、定数倍の差があるぐらい許容しようと思った。グラフ理論や木構造についてもっと理解を深めていく過程で、この定数倍の差を埋める仕組みについて知れたら、考えられたらと思う。
 ・要素が10,000件以内なら、トラバースしても0.1秒以内で終わるかな。という感じなので、問題になりそうなデータ数を、ある表示単位の最大件数としようかな。という感じ。それなら、理解が深まれば上限を増やしていける。(無制限にするのは、誰にとってもあまり良くない)
 ・Macでは、メニューが3種類ある。メニューバーメニュー、コンテキストメニュー、Dockメニュー。iPadでキーボードショートカット用にメニューをちゃんと作っていれば、メニューバーメニューもコンバートされて動くし、iPadでコンテキストメニューを使っていれば、Macにおける右クリックのコンテキストメニューと同じ動きになる。
 ・
 
 */
//: [Next](@next)
